[
      {
        "statement": "A day on Venus is longer than a year on Venus.",
        "explanation": "Venus rotates once in 243 Earth days but orbits the Sun in 225 Earth days."
      },
      {
        "statement": "There are more stars in the universe than grains of sand on all of Earth's beaches.",
        "explanation": "The universe contains over 100 billion galaxies, each with billions or trillions of stars."
      },
      {
        "statement": "A spoonful of a neutron star would weigh about 6 billion tons.",
        "explanation": "Neutron stars are extremely dense, and a spoonful would weigh more than 6 billion tons."
      },
      {
        "statement": "The largest volcano in the solar system is on Mars, and it's three times the height of Mount Everest.",
        "explanation": "Olympus Mons on Mars stands at 13.6 miles (22 kilometers) tall."
      },
      {
        "statement": "Saturn's moon Titan has lakes of liquid methane.",
        "explanation": "Titan has lakes made of liquid methane and ethane due to its extremely cold temperatures."
      },
      {
        "statement": "One teaspoon of a black hole would weigh as much as Mount Everest.",
        "explanation": "Black holes are incredibly dense, and even a tiny amount of matter would have immense mass."
      },
      {
        "statement": "The Sun makes up about 99.86% of the mass of the entire solar system.",
        "explanation": "The Sun is by far the largest object in the solar system, with a mass more than 300,000 times that of Earth."
      },
      {
        "statement": "A year on Mercury is just 88 Earth days.",
        "explanation": "Mercury's orbit around the Sun is the shortest in the solar system, taking only 88 days."
      },
      {
        "statement": "There are more planets than stars in the Milky Way galaxy.",
        "explanation": "It's estimated that there are 100-400 billion stars in the Milky Way, but likely more planets."
      },
      {
        "statement": "Jupiter's Great Red Spot is a massive storm that has been raging for over 400 years.",
        "explanation": "The Great Red Spot is a huge storm on Jupiter that has persisted for centuries."
      },
      {
        "statement": "The Hubble Space Telescope has helped discover over 1,000 exoplanets.",
        "explanation": "Hubble has significantly advanced our understanding of planets beyond our solar system."
      },
      {
        "statement": "Pluto's orbit is so elliptical that sometimes it is closer to the Sun than Neptune.",
        "explanation": "Pluto's highly elliptical orbit brings it closer to the Sun than Neptune for 20 years of its orbit."
      },
      {
        "statement": "The largest known star, UY Scuti, is over 1,700 times larger than the Sun.",
        "explanation": "UY Scuti is a red supergiant star in the constellation of the Whale."
      },
      {
        "statement": "There are more than 200 moons orbiting the planets in our solar system.",
        "explanation": "The solar system contains over 200 moons orbiting various planets, with Jupiter and Saturn having the most."
      },
      {
        "statement": "If you could travel at the speed of light, it would take you over 4 years to reach the nearest star, Proxima Centauri.",
        "explanation": "Proxima Centauri, the closest star to Earth, is 4.24 light-years away."
      },
      {
        "statement": "The Moon is moving away from Earth at a rate of about 1.5 inches per year.",
        "explanation": "The Moon's gravitational pull causes it to slowly drift away from Earth at this rate."
      },
      {
        "statement": "Mars has the tallest volcano and the deepest, longest canyon in the solar system.",
        "explanation": "Olympus Mons and the Valles Marineris canyon system make Mars a geological wonder."
      },
      {
        "statement": "Saturn's moon Enceladus has geysers that shoot water vapor into space.",
        "explanation": "Enceladus has water jets erupting from its surface, suggesting it has a subsurface ocean."
      },
      {
        "statement": "A year on Uranus lasts about 84 Earth years.",
        "explanation": "Uranus takes 84 Earth years to orbit the Sun due to its distant position in the solar system."
      },
      {
        "statement": "The largest ocean in the solar system is under the ice of Jupiter's moon Europa.",
        "explanation": "Europa has a massive ocean of liquid water beneath its icy surface."
      },
      {
        "statement": "The Voyager 1 spacecraft is the farthest human-made object from Earth.",
        "explanation": "Launched in 1977, Voyager 1 has crossed into interstellar space and continues transmitting data."
      },
      {
        "statement": "Saturn’s rings are made of billions of icy particles, some as small as dust and others as large as mountains.",
        "explanation": "The rings are composed of ice, dust, and rock particles of varying sizes."
      },
      {
        "statement": "One day on Mars is just over 24 hours, almost the same as an Earth day.",
        "explanation": "A Mars day, or sol, lasts 24 hours, 39 minutes."
      },
      {
        "statement": "The largest moon of Saturn, Titan, is larger than the planet Mercury.",
        "explanation": "Titan is the second-largest moon in the solar system, even bigger than Mercury."
      },
      {
        "statement": "The Milky Way galaxy is on a collision course with the Andromeda galaxy.",
        "explanation": "The Milky Way and Andromeda galaxies are expected to collide in about 4.5 billion years."
      },
      {
        "statement": "There are rogue planets in space that do not orbit any star.",
        "explanation": "Rogue planets are free-floating and do not orbit any star, likely ejected from their original systems."
      },
      {
        "statement": "The largest black hole in the universe is over 40 billion times the mass of our Sun.",
        "explanation": "Ton 618, located in a distant galaxy, holds the title of the largest known black hole."
      },
      {
        "statement": "The first manned mission to the Moon, Apollo 11, landed in 1969.",
        "explanation": "Neil Armstrong and Buzz Aldrin became the first humans to walk on the Moon during Apollo 11."
      },
      {
        "statement": "A full moon is about 14% larger and 30% brighter when it is closer to Earth (called a supermoon).",
        "explanation": "A supermoon happens when the Moon is at its closest point to Earth in its orbit."
      },
      {
        "statement": "Neutron stars are so dense that a single teaspoon would weigh as much as a mountain.",
        "explanation": "Neutron stars are incredibly dense remnants of massive stars, making them super heavy."
      },
      {
        "statement": "There are more than 500,000 pieces of space junk orbiting Earth.",
        "explanation": "Space debris includes defunct satellites, rocket parts, and other debris, posing risks to space missions."
      },
      {
        "statement": "The largest known comet, C/2014 UN271, is bigger than a planet.",
        "explanation": "C/2014 UN271 is a comet with a nucleus around 130 kilometers wide, far larger than most planets."
      },
      {
        "statement": "Saturn’s moon Iapetus has a mysterious two-tone coloration, with one side dark and the other bright.",
        "explanation": "Iapetus has one side much darker than the other, and scientists are still unsure why."
      },
      {
        "statement": "The Moon's gravity is responsible for Earth's tides.",
        "explanation": "The Moon’s gravitational pull creates the rise and fall of tides on Earth."
      },
      {
        "statement": "The largest canyon in the solar system, Valles Marineris, stretches over 4,000 km on Mars.",
        "explanation": "Valles Marineris is a massive canyon that dwarfs the Grand Canyon on Earth."
      },
      {
        "statement": "There are no active volcanoes on Earth that have lava as hot as Venus’s surface.",
        "explanation": "Venus’s surface temperatures reach 900°F (475°C), hotter than molten lava on Earth."
      }
    ]

  